#+TITLE: Modernes C++\linebreak \small...für Programmierer \hfill Unit 03: Datentypen & Deklarationen
#+AUTHOR: Dr. Günter Kolousek
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX: \newcommand{\cppXIV}{C++14\xspace}
#+LATEX: \newcommand{\cppXI}{C++11\xspace}
#+LATEX: \newcommand{\cppXVII}{C++17\xspace}

* Zahlenliterale -- 2
\vspace{1em}
#+header: :exports both :results output :tangle src/numbers.cpp :flags -std=c++14
#+BEGIN_SRC C++
#include <iostream>  // numbers.cpp
using namespace std;
int main() {
    cout << 123'456'789 << endl;
    cout << hex << 0xFF << endl;
    cout << 0777 << ' ' << oct << 0777 << endl;
    cout << showbase << hex << 0xCAFE << endl;
    cout << dec << 0xff << endl;
}
#+END_SRC

#+RESULTS:
: 123456789
: ff
: 1ff 777
: 0xcafe
: 255

* Formatierung der Ausgabe
\vspace{1em}
#+header: :exports both :results output :tangle src/outnums.cpp :flags -std=c++14
#+BEGIN_SRC C++
#include <iostream>  // outnums.cpp
#include <iomanip>  // setw, setfill,...
using namespace std;
int main() {
    cout << left << setw(5) << 3 << 'm' << endl;
    cout << 3 << 'm' << endl;  // reset!
    cout << internal << setw(5)<< -3<< 'm'<< endl;
    cout << right << setw(5) << -3 << 'm' << endl;
    cout<< setfill('*')<< setw(5)<< 3<< 'm'<< endl;
}
#+END_SRC

#+RESULTS:
: 3     m
: 3m
: -   3m
:    -3m
: ****3m

* Formatierung der Ausgabe -- 2
\vspace{1.5em}
#+header: :exports both :results output :tangle src/outnums2.cpp :flags -std=c++14
#+BEGIN_SRC C++
#include <iostream>  // outnums2.cpp
#include <iomanip>  // setw, setfill,...
using namespace std;
int main() {
    cout << uppercase << hex << 0xcafe << endl;
    double pi = 3.1415926;
    cout << pi << ' ';
    cout << setprecision(3) << pi << ' ';
    cout << showpos << pi << endl;
    cout << showpoint << setprecision(10) << 2.78
         << endl << pi << endl;
}
#+END_SRC

#+RESULTS:
: CAFE
: 3.14159 3.14 +3.14
: +2.780000000
: +3.141592600

